package edu.traning.lesson14.customer;

public class Main {
    public static void main(String[] args) {
        Bank bank1 = new Bank();

        bank1.add(new Customer("Иванов", "Иван", "Иванович", "9713445764017119", "70119521545329296449"));
        bank1.add(new Customer("Сидоров", "Георгий", "Русланович", "3469938343453006", "43241091440941421999"));
        bank1.add(new Customer("Бобаев", "Валентин", "Олегович", "1433762838206611", "35098192562581955048"));
        bank1.add(new Customer("Аверкин", "Клим", "Сергеевич", "3441015996954936", "66330891981870604338"));
        bank1.add(new Customer("Миролевич", "Роман", "Андреевич", "1971797880904234", "19064809698511512929"));
        bank1.add(new Customer("Смольская", "Дарья", "Александровна", "9252317452207615", "36332144891086539684"));
        bank1.add(new Customer("Дубровская", "Екатерина", "Андреевна", "4592660490155109", "38966599966533213200"));
        bank1.add(new Customer("Серова", "Алина", "Сергеевна", "2013411726340902", "90599035215246225464"));
        bank1.sortCustomersByName();
        bank1.print();

        System.out.println();

        Bank bank2 = new Bank();

        bank2.add(new Customer("Иванов", "Иван", "Иванович", "9713445764017119", "70119521545329296449"));
        bank2.add(new Customer("Сидоров", "Георгий", "Русланович", "3469938343453006", "43241091440941421999"));
        bank2.add(new Customer("Бобаев", "Валентин", "Олегович", "1433762838206611", "35098192562581955048"));
        bank2.add(new Customer("Аверкин", "Клим", "Сергеевич", "3441015996954936", "66330891981870604338"));
        bank2.add(new Customer("Миролевич", "Роман", "Андреевич", "1971797880904234", "19064809698511512929"));
        bank2.add(new Customer("Смольская", "Дарья", "Александровна", "9252317452207615", "36332144891086539684"));
        bank2.add(new Customer("Дубровская", "Екатерина", "Андреевна", "4592660490155109", "38966599966533213200"));
        bank2.add(new Customer("Серова", "Алина", "Сергеевна", "2013411726340902", "90599035215246225464"));
        bank2.findByCard("2940557966398044", "6165588348717566");


    }

}
